function cft = default_config()
    cft = struct();
    
    % earth
    cft.earth.physical = struct(...
    'name',     'earth',...         % 名称
    'Mp',       5.9722e24,...       % 质量
    'Rp',       6.371e6,...         % 半径
    'g',        9.80665,...         % 地表重力加速度
    'M',        0.028944,...        % 平均相对分子质量
    'Mv',       0.018015,...        % 可凝结组分的相对分子质量（H2O）
    'cp',       1005,...            % 定压比热容
    'L',        2.501e6,...         % 汽化热（焓变）
    'S0',       1361,...            % 地表辐照度
    'alpha',    0.295,...           % 行星反照率
    'emis',     0.97,...            % 地表发射率
    'e0',       611.2,...           % 饱和曲线参考蒸气压
    'T0',       273.15,...          % 饱和曲线参考温度
    'RH',       0.75,...            % 相对湿度廓线
    'CD',       1.3e-3,...          % 拖拽系数
    'V',        5);                 % 近地面风速

    cft.earth.grid = struct(...
    'ps',       1.01325e5,...       % 表面气压
    'ptop',     0.5,...             % 大气顶气压
    'N',        40,...              % 层数
    'stretch',  1.2);               % 几何比

    cft.earth.radiation = struct(...
    'nb',           2,...           % 辐射带数
    'fband',        [0.8,0.2],...   % 发射权重
    'kappa',        0,...           % 质量吸收系数
    'q_aborber',    0,...           % 吸收体混合比
    'pscale',       0.6,...         % 压力标度指数
    'cloud',        []);            % 云吸收

end